#BCDCalc 1.0.2
#Программа для вычисления разницы в цене и процентах между двумя ценовыми величинами.



#Окно приветствия с описанием назначения и функционалом.

print('\n ''''                               Ваc приветствует программа-вычислитель!
         
         Вы можете вычислить разницу в количественном и процентном соотношении между заданными числами.
         Была создана для вычисления разницы в цене на криптовалютных биржах. 
         Может  применятся для вычисления разницы для любых 2 водных.
         
         Примечание: Для вычисления падения цены: 
                     В начале вводите наименьшую цену потом наибольшую.
                     Для вычисления роста цены:
                     В начале вводите наибольшую цену потом наименьшую.
                                                                      
         ''')


#Интерактивная строка
try:
      num_1 = float(input('Первая цена:\n'))
      num_2 = float(input('Вторая цена:\n'))
except ValueError:
       print('Вы вели буквы. Введите цифры')

#"Движок" программы

p = num_1-num_2
z = p*100/num_1


#Вывод результата

print("\033[032m","\n","Цена изменилась на ", z, "%",        #\033[032m - цветовой ASCII-код (зеленый)
      "по отношению ко второй","\n", "Или", p, "$ единиц "   #Подробнее "https://clck.ru/WYSFV"
      "в количественном выражении")






'''

    ████████████████████████████████████████████████████████████████████████████████
    ████████████████`"└ ▀█████████████████████████████████████████████▀▀:   ████████
    █████████████▀,         └²▀▀████████████████████████████████████▀,     ▄████████
    ████████████▀                '▀████████████████████████████████^   ,▄▄██████████
    ████████████▄▄                  "▀████████████████████████████` ,▄██████████████
    ██████████████████▄                └▀████████████████████████, ▄████████████████
    ███████████▀▀└:.'²└                   "▀████████████████████^ ▄█████████████████
    ███████████   ,▄,                       `▀▀████████████████~ ███████████████████
    ████████████▄▄█████▄▄▄,;▄▄██▄              `└▀██████████▀▀ .████████████████████
    ██████████████████████████████▄▄               `└^▀▀▀▀─   ▄█████████████████████
    ██████████████████████████████████▄▄;                   ¢███████████████████████
    █████████████████████████████████████████████▄▄`         ▀██████████████████████
    ████████████████████████████████████████████████▄        `██████████████████████
    █████████████████████████████████████████████████▌        ▐█████████████████████
    ██████████████████████████████████████████████████▄       ▐█████████████████████
    ███████████████████████████████████████████████████▄      ⁿ█████████████████████
    █████████████████████████████████████████████████████▄    `█████████████████████
    ███████████████████████████████████████████████████████▄   "▀███████████████████
    █████████████████████████████████████████████████████████▄¿   ██████████████████
    ███████████████████████████████████████████████████████████   ╙█████████████████
    ███████████████████████████████████████████████████████████    ▐████████████████
    ███████████████████████████████████████████████████████████▌   █████████████████
    █████████████████████████████████████████████████████████████══█████████████████
     
     Development by ---Puma---
'''
